{
  "backend/main.mo": "Defines the main canister with authorization, donor profiles, donations, spending, user profiles, and site metrics, including methods for profile management and donation handling.",
  "backend/migration.mo": "Provides a simple migration module that returns state unchanged.",
  "feature_evidence.json": "Lists feature evidence reports mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files used across the application.",
  "frontend/index.css": "Tailwind CSS configuration defining global CSS variables and theming for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up the application router, defines all routes, and wraps the app with theme and toaster providers.",
  "frontend/src/components/admin/SpendingForm.tsx": "Form component for admins to record spending with validation, balance checks, and mutation submission.",
  "frontend/src/components/auth/AdminGuard.tsx": "Protects admin-only sections by checking authentication and admin status, showing access-denied or loading states.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and clearing cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to enter basic info and save it via mutation.",
  "frontend/src/components/donate/DonationForm.tsx": "Form for submitting donations, handling both authenticated and anonymous donors and sending data to the backend.",
  "frontend/src/components/donors/DonorsTable.tsx": "Displays a clickable table of donor profiles with avatars, join dates, and total donated amounts.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Simple access‑denied page with an error icon, message, and link back to the dashboard.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing copyright text and a link to caffeine.ai with minor branding.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with metrics, navigation links, donate/login actions, and mobile menu support.",
  "frontend/src/components/layout/SiteLayout.tsx": "Root layout that tracks site views and live viewer status, wraps pages with header/footer, and shows the profile setup modal.",
  "frontend/src/components/ledger/LedgerFilters.tsx": "UI controls to filter transactions by type and sort order.",
  "frontend/src/components/ledger/LedgerTable.tsx": "Table listing donation and spending transactions with icons, amounts, dates, and status, linking to detail pages.",
  "frontend/src/components/ledger/RecentTransactionsList.tsx": "Displays a merged, sorted list of recent donation and spending transactions with navigation to detailed views.",
  "frontend/src/components/ledger/SpendingBreakdownCard.tsx": "Aggregates spending records into categories and renders a pie chart visualization using Recharts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks if the current authenticated user is an admin using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating donation, spending, metrics, and donor-related data via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes using OKLCH colors.",
  "frontend/src/main.tsx": "Bootstraps the app, setting up React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/admin/AdminDonationsPage.tsx": "Admin interface for reviewing, confirming, or declining donations with status badges and recent activity.",
  "frontend/src/pages/admin/AdminSpendingPage.tsx": "Admin-only page showing trust balance, recent spending, and a form to record new spending using query hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing trust balance, donation and spending stats, hero section, recent transactions, and navigation to donate or ledger pages.",
  "frontend/src/pages/DonatePage.tsx": "Donation page displaying benefits of donating, user identity context, and a form for submitting a new donation.",
  "frontend/src/pages/DonorDetailPage.tsx": "Displays detailed donor information with admin/non-admin views and lists the donor’s past donations.",
  "frontend/src/pages/DonorsPage.tsx": "Lists all donors with admin-sensitive data handling and fallback loading or empty states.",
  "frontend/src/pages/LedgerPage.tsx": "Shows combined donation and spending transactions with filters and sorting options.",
  "frontend/src/pages/TransactionDetailPage.tsx": "Displays full details for a single donation or spending record, including formatted amount and timestamp.",
  "frontend/src/utils/approvedImage.ts": "Exports the single approved image path used across the UI.",
  "frontend/src/utils/phoneMask.ts": "Provides a function to mask phone numbers by exposing only the first five characters.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, containers, animations, and plugin setup.",
  "project_state.json": "Project metadata describing requirements, existing features, issues, and architectural constraints."
}