{
  "backend/main.mo": "Main Motoko actor defining data models (Donation, Donor, Spending, UserProfile, ContactForm, DonorPrivacy) and including authorization and blob storage mixins for a charitable trust donation platform.",
  "feature_evidence.json": "Feature evidence report documenting the addition of Google site verification meta tag to frontend/index.html with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend React components, pages, and hooks including routing, authentication, admin features, donation tracking, and UI components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "Main HTML entry point with comprehensive SEO meta tags, Open Graph/Twitter cards, Google site verification, structured data schema for NGO, and links to sitemap/robots.txt.",
  "frontend/public/robots.txt": "Robots.txt file allowing all search engines to crawl the site with a 1-second crawl delay and sitemap reference.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public pages (home, donate, ledger, donors, about, contact, services) with priorities and change frequencies for SEO.",
  "frontend/src/App.tsx": "Root React application component configuring TanStack Router with public routes (wrapped in SiteLayout) and admin routes (wrapped in AdminLayout), plus ThemeProvider and Toaster.",
  "frontend/src/components/admin/AdminNotifications.tsx": "Admin-only notification bell popover component that currently displays an empty state placeholder for future donation and spending activity notifications.",
  "frontend/src/components/admin/SpendingForm.tsx": "Form component for admins to record trust spending with amount (in INR converted to paise), description, and balance validation. Displays success toast and notifies partner on submission.",
  "frontend/src/components/auth/AdminGuard.tsx": "Route guard component that checks if the authenticated user has admin permissions, showing loading state or access denied screen as appropriate.",
  "frontend/src/components/auth/AuthGate.tsx": "Login screen component displaying a welcome card with Internet Identity sign-in button and loading state during authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "Reusable login/logout button component that handles Internet Identity authentication and clears query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for first-time users to set up their profile with name, age, email, phone (validated Indian format), and gender. Cannot be dismissed until completed.",
  "frontend/src/components/donate/DonationForm.tsx": "Main donation form handling user details, amount (min ₹10), payment screenshot upload with preview, and submission with validation. Generates payment reference and converts amount to paise.",
  "frontend/src/components/donate/UpiPaymentSection.tsx": "Step 1 payment instructions component displaying UPI IDs, amount, and payment reference with copy-to-clipboard functionality for each field.",
  "frontend/src/components/donors/DonorsTable.tsx": "Table component displaying donor profiles with avatar, name, join date, and total donated amount. Rows are clickable to navigate to individual donor detail pages.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Error screen component showing access denied message with shield icon and button to return to dashboard.",
  "frontend/src/components/feedback/ProverbFeedbackPrompt.tsx": "A card component that displays a proverb to donors and collects like/dislike feedback, showing a thank-you message after submission.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin portal layout with navigation to dashboard, donations, and spending pages, including mobile menu support and admin guard protection.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component displaying copyright, mission statement, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Main site header with logo, navigation menu, live metrics bar (total views and live viewers), and mobile menu support.",
  "frontend/src/components/layout/SiteLayout.tsx": "Root layout wrapper that handles authentication gating, profile setup modal, view tracking, and renders header/footer with page content.",
  "frontend/src/components/ledger/LedgerFilters.tsx": "Filter controls for the ledger page allowing users to filter by transaction type (all/incoming/outgoing) and sort order (newest/oldest).",
  "frontend/src/components/ledger/LedgerTable.tsx": "Table component displaying transaction records with type icons, descriptions, dates, amounts in INR, and status badges, with clickable rows linking to transaction details.",
  "frontend/src/components/ledger/RecentTransactionsList.tsx": "Card component showing the 10 most recent transactions (donations and spending combined) sorted by timestamp, with navigation to full ledger and transaction details.",
  "frontend/src/components/ledger/SpendingBreakdownCard.tsx": "React component that displays a pie chart breakdown of spending records by category (Food, Education, Healthcare, Shelter, Clothing, Other) using Recharts, with category detection based on description keywords.",
  "frontend/src/components/services/ServiceActivityForm.tsx": "Form component for creating or editing service activity entries with title, description, author, notes, and image uploads; handles file validation, upload progress tracking, and submission via mutations.",
  "frontend/src/components/services/ServiceActivityList.tsx": "Displays a list of service activity entries as cards with image carousels, metadata (date, author, image count), description, and optional notes.",
  "frontend/src/config/upi.ts": "Configuration file defining UPI payment details including primary and secondary VPA IDs, payee name, and merchant code for non-profit donations.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with authentication via Internet Identity, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useAdminStatus.ts": "React hook that queries the backend to determine if the current authenticated user has admin privileges.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence in local storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom React hook that synchronizes state with localStorage, providing a useState-like interface with automatic persistence and SSR safety.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including trust balance, donations, spending, site metrics, user profiles, donor profiles, service activities, and admin operations.",
  "frontend/src/hooks/useViewTracking.ts": "Provides two hooks: useViewTracking() registers a single page view per session with retry logic and exponential backoff, and useLiveViewerSession() manages live viewer sessions with heartbeats and automatic cleanup on page unload.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, including colors for backgrounds, foregrounds, borders, and chart elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays information about the organization's founders (two 18-year-old engineering students), their vision for transparent giving, mission statement, and core values using card-based layout components.",
  "frontend/src/pages/admin/AdminDonationsPage.tsx": "Admin page for managing donations with pending and recent donation lists, allowing admins to confirm or decline donations with payment screenshot verification.",
  "frontend/src/pages/admin/AdminPortalPage.tsx": "Admin dashboard landing page displaying quick stats (trust balance, site views, live viewers) and navigation cards to donation and spending management sections.",
  "frontend/src/pages/admin/AdminSpendingPage.tsx": "Admin page for recording new spending records and viewing recent spending history, with available trust balance display.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation for name, email, Indian phone numbers, message, and inquiry type that submits to the backend actor's submitContactForm method with error handling and success notifications.",
  "frontend/src/pages/DashboardPage.tsx": "Main landing page displaying hero section with call-to-action buttons, financial statistics cards (balance, donations, spending), spending breakdown, and recent transactions using data from multiple query hooks.",
  "frontend/src/pages/DomainSetupPage.tsx": "Documentation page providing step-by-step instructions for configuring DNS records (CNAME and TXT) to point a custom domain (whynotus.org.in) to an Internet Computer canister with copy-to-clipboard functionality.",
  "frontend/src/pages/DonatePage.tsx": "Donation page component that displays a donation form with UPI payment instructions, features cards highlighting verification and transparency, and shows donation process information. Supports both authenticated and anonymous donations.",
  "frontend/src/pages/DonorDetailPage.tsx": "Donor detail page that displays comprehensive donor profile information including avatar, contact details, and donation history. Shows full profile data to admins and masked/public data to regular users.",
  "frontend/src/pages/DonorsPage.tsx": "Donors listing page that displays all donors in a table format. Fetches and shows full donor profiles for admins or public profiles for regular users.",
  "frontend/src/pages/LedgerPage.tsx": "Transaction ledger page that combines and displays both donations (incoming) and spending records (outgoing) with filtering by transaction type and sorting by date. Provides complete financial transparency.",
  "frontend/src/pages/ProjectBriefPage.tsx": "Project brief documentation page with a textarea for entering website requirements and summaries. Features auto-save to localStorage, copy to clipboard, and export as text file functionality.",
  "frontend/src/pages/ServicesPage.tsx": "Services page displaying service activities showing how donations are used. Includes admin controls for adding, editing, and deleting service activities with confirmation dialogs.",
  "frontend/src/pages/TransactionDetailPage.tsx": "Displays detailed information for a single transaction (donation or spending record) by ID, including status badges, formatted amounts, and conditionally shows a proverb feedback prompt for confirmed female donations without feedback.",
  "frontend/src/utils/approvedImage.ts": "Exports the single source of truth path for the hero/dashboard promotional image asset.",
  "frontend/src/utils/canisterError.ts": "Utility function to extract user-friendly error messages from canister/agent errors by parsing reject text, trap messages, and error patterns.",
  "frontend/src/utils/donationInputNormalization.ts": "Provides normalization and validation functions for Indian phone numbers, UTR codes, and amounts to handle mobile formatting (spaces, hyphens, commas) in donation forms.",
  "frontend/src/utils/donorAvatarImage.ts": "Exports the single source of truth path for the donor avatar image asset used across all donor profiles.",
  "frontend/src/utils/fileToUint8Array.ts": "Converts a File object to Uint8Array using FileReader for blob storage uploads.",
  "frontend/src/utils/formatCurrency.ts": "Formats bigint amounts in minor units (paise) as Indian Rupees with proper locale formatting and ₹ symbol.",
  "frontend/src/utils/maskUtr.ts": "Empty utility file, likely intended for UTR masking functionality but currently contains no code.",
  "frontend/src/utils/paymentReference.ts": "Generates short, human-readable payment reference codes using crypto-safe randomness with alphanumeric characters excluding ambiguous ones.",
  "frontend/src/utils/phoneMask.ts": "Exports a function to mask phone numbers by showing only the first 5 characters followed by asterisks, used as a defensive fallback for non-admin views.",
  "frontend/src/utils/siteBranding.ts": "Exports site branding asset paths (logo, favicon) and re-exports domain configuration constants from siteConfig.ts.",
  "frontend/src/utils/siteConfig.ts": "Centralized site configuration including domain (whynotus.org.in), site name, environment detection, and utility functions for building canonical URLs and extracting canister IDs.",
  "frontend/src/utils/upiDiagnostics.ts": "Generates user-friendly, copyable diagnostic text for UPI payment issues, excluding sensitive data like phone, email, and UTR.",
  "frontend/src/utils/upiQrImage.ts": "Exports UPI QR code image path, version constant for cache-busting, and a helper function to get the cache-busted QR URL.",
  "frontend/src/utils/urlParams.ts": "Utility functions for parsing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and parameter cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Inter font family, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking a feature request to add Google site verification meta tag to the frontend index.html head section."
}