{
  "backend/main.mo": "Motoko canister managing donations, spending, user profiles, and admin-protected actions using an authorization mixin and in‑memory lists/maps.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React router configuration defining all public and admin routes wrapped in theme and toaster providers.",
  "frontend/src/components/admin/SpendingForm.tsx": "Form for admins to create spending records with validation, balance checks, and mutation handling.",
  "frontend/src/components/auth/AdminGuard.tsx": "Component that restricts access to admin-only content based on authentication and admin status.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and clearing cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal shown to authenticated users without a saved profile, allowing them to enter and save name, email, and phone.",
  "frontend/src/components/donate/DonationForm.tsx": "Handles donation submission with amount, donor info, and optional message, supporting both authenticated and anonymous donors.",
  "frontend/src/components/donors/DonorsTable.tsx": "Displays a clickable table of donor profiles with initials, contact info, join date, and total donated.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Shows an access denied message with a button to return to the dashboard.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with copyright text and a link crediting caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Displays the site header with navigation, donate button, login, and responsive mobile menu, including admin links when applicable.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top‑level layout combining header, footer, routed content, and the profile setup modal.",
  "frontend/src/components/ledger/LedgerFilters.tsx": "Provides UI controls for filtering and sorting ledger transactions by type and date.",
  "frontend/src/components/ledger/LedgerTable.tsx": "Shows a table of donation and spending transactions with type, description, date, amount, and status, linking to transaction details.",
  "frontend/src/components/ledger/RecentTransactionsList.tsx": "Combines donation and spending records, sorts them by timestamp, and displays the ten most recent with navigation links.",
  "frontend/src/components/ledger/SpendingBreakdownCard.tsx": "Groups spending records into categories and renders a pie chart showing category distribution.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the current authenticated user is an admin using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity storage, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for donations, spending, user profiles, and related mutations.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing QueryClient and InternetIdentityProvider context.",
  "frontend/src/pages/admin/AdminDonationsPage.tsx": "Admin page for reviewing, confirming, and declining donations, highlighting pending items and recent activity.",
  "frontend/src/pages/admin/AdminSpendingPage.tsx": "Admin-only page that displays trust balance, recent spending records, and a form to add new spending entries.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing trust balance, donation and spending stats, hero section, and recent transactions using various query hooks.",
  "frontend/src/pages/DonatePage.tsx": "Donation page with promotional content and a DonationForm, supporting anonymous or authenticated donors.",
  "frontend/src/pages/DonorDetailPage.tsx": "Displays detailed donor profile info and their donation history with loading and not‑found states.",
  "frontend/src/pages/DonorsPage.tsx": "Lists all donor profiles in a table with loading and empty states.",
  "frontend/src/pages/LedgerPage.tsx": "Combines and filters donations and spending records into a sortable transaction ledger.",
  "frontend/src/pages/TransactionDetailPage.tsx": "Shows detailed information for a single donation or spending record with status, amount, and timestamp.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning URL hash parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugin setup.",
  "project_state.json": "Project metadata file describing features, requirements, current state, and image needs for the trust donation platform."
}