{
  "backend/main.mo": "Defines actor with authorization mixin, types for donations, donors, spending, user profiles, and stores state plus profile management and phone validation logic.",
  "feature_evidence.json": "Feature evidence report describing replacement of a UPI QR asset and listing related components and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping frontend file paths to short summaries explaining each component or page's purpose.",
  "frontend/index.css": "Tailwind CSS base styles and theme variables for light and dark modes, including color tokens and layout defaults.",
  "frontend/index.html": "HTML entry file setting up root container and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public and admin pages and wraps the app with theme provider and toaster.",
  "frontend/src/components/admin/SpendingForm.tsx": "Form allowing admins to add spending records with validation, balance checks, and mutation submission.",
  "frontend/src/components/auth/AdminGuard.tsx": "Component that restricts access to admin-only sections based on authentication and admin status.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and validate basic profile details before saving via API.",
  "frontend/src/components/donate/DonationForm.tsx": "Donation submission form handling amount, user details, phone/UTR validation, prefilling profile data, and sending donation records.",
  "frontend/src/components/donate/UpiPaymentSection.tsx": "UI block for UPI payments including QR display, deep‑link attempts, copy helpers, and error fallback handling.",
  "frontend/src/components/donors/DonorsTable.tsx": "Table listing donors with initials, contact info, join date, and total donated, with navigation to individual donor pages.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Simple screen showing an access‑denied message with a button redirecting users to the dashboard.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin-only layout providing header, navigation, mobile menu, and wrapper around admin routes using AdminGuard.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying copyright, tagline, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with logo, navigation, metrics display, admin links, and mobile menu controls.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper rendering header, footer, routed content, and triggers view tracking hooks.",
  "frontend/src/components/ledger/LedgerFilters.tsx": "Filter UI for ledger page allowing transaction type and sort order selection.",
  "frontend/src/components/ledger/LedgerTable.tsx": "Table displaying transaction entries with links, formatted amounts, dates, and status badges.",
  "frontend/src/components/ledger/RecentTransactionsList.tsx": "Card showing the 10 most recent combined donation and spending records with navigation on click.",
  "frontend/src/components/ledger/SpendingBreakdownCard.tsx": "Pie chart summarizing categorized spending amounts using description-based category detection.",
  "frontend/src/config/upi.ts": "UPI payment config and function to generate a standardized UPI intent URI.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdminStatus.ts": "Hook that checks if the authenticated caller is an admin using the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for managing Internet Identity auth, including login, logout, and restoring identities. Wraps AuthClient creation with custom options and exposes login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching donations, spending, metrics, and donor data from the backend actor. Handles actor readiness, defaults, retries, and pagination.",
  "frontend/src/hooks/useViewTracking.ts": "Implements page‑view tracking and live‑viewer session tracking with retries, heartbeats, and React Query cache invalidation. Ensures per‑tab view registration and session lifecycle management.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light/dark theme CSS variables for colors, borders, and UI tokens. Applies global background, text, and border styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in QueryClientProvider and InternetIdentityProvider. Renders the App component and loads global styles.",
  "frontend/src/pages/admin/AdminDonationsPage.tsx": "Provides admin tools to review, confirm, decline, and manage donations, with status badges and UTR copying.",
  "frontend/src/pages/admin/AdminPortalPage.tsx": "Shows admin metrics, trust balance, and navigation to management tools along with an informational notice.",
  "frontend/src/pages/admin/AdminSpendingPage.tsx": "Admin page showing current balance, recent spending, and a form to record new spending.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard UI displaying trust balance, donations, spending stats, and recent activity using backend queries. Includes hero section, stats cards, and navigation actions.",
  "frontend/src/pages/DonatePage.tsx": "Donation page showing UPI instructions, transparency info, and a donation form. Adjusts messaging based on user identity and fetches caller profile.",
  "frontend/src/pages/DonorDetailPage.tsx": "Displays a donor’s full or public profile depending on admin status and lists their donations, with loading states and navigation.",
  "frontend/src/pages/DonorsPage.tsx": "Shows a table of donors, fetching either full or public profiles based on admin status with loading and empty states.",
  "frontend/src/pages/LedgerPage.tsx": "Combines donations and spending into a sortable, filterable transaction ledger with loading and empty states.",
  "frontend/src/pages/TransactionDetailPage.tsx": "Finds a specific donation or spending record and displays detailed transaction info, handling loading and not‑found scenarios.",
  "frontend/src/utils/approvedImage.ts": "Exports the approved image path used across the UI.",
  "frontend/src/utils/donationInputNormalization.ts": "Provides normalization and validation utilities for phone numbers, UTRs, and amount inputs.",
  "frontend/src/utils/formatCurrency.ts": "Formats bigint amounts into INR currency strings.",
  "frontend/src/utils/maskUtr.ts": "Masks UTR values by exposing only the first and last three characters.",
  "frontend/src/utils/phoneMask.ts": "Masks phone numbers by showing the first five characters and replacing the rest with asterisks.",
  "frontend/src/utils/upiQrImage.ts": "Exports the file path for the UPI QR code image.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and plugins.",
  "project_state.json": "Stores the project’s build state, requirements, issues, and architectural notes."
}