{
  "backend/main.mo": "Defines the main canister with donation, donor, spending, and user profile types plus access control, storage lists/maps, notifications, and profile management methods.",
  "backend/migration.mo": "Contains migration logic converting old actor data to updated donor and user profile shapes with new gender and age fields.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to frontend files and components with confidence and test IDs.",
  "frontend-file-summaries.txt": "JSON-like list summarizing major frontend files and their responsibilities across routing, components, hooks, and pages.",
  "frontend/index.css": "Tailwind CSS base/theme variables and dark‑mode definitions customizing color tokens and global styles.",
  "frontend/index.html": "Base HTML entry with root div and script loading the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public and admin pages and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/admin/AdminNotifications.tsx": "Admin-only notification popover listing notifications with unread count, mark-as-read, and dismiss actions using React Query hooks.",
  "frontend/src/components/admin/SpendingForm.tsx": "Form for admins to record spending with amount validation, balance checks, and mutation submission.",
  "frontend/src/components/auth/AdminGuard.tsx": "Gatekeeper component that checks identity and admin status before rendering children, otherwise shows loading or access denied.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter profile details with validation and save mutation.",
  "frontend/src/components/donate/DonationForm.tsx": "Donation form handling user data prefill, amount/phone/UTR validation, and donation submission.",
  "frontend/src/components/donate/UpiPaymentSection.tsx": "UPI payment instructions component providing copy-to-clipboard, deep link launch, and fallback handling.",
  "frontend/src/components/donors/DonorsTable.tsx": "Table displaying donor profiles with join date, total donated, and navigation on row click.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Screen informing users they lack permissions and offering navigation back to the dashboard.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin layout wrapper enforcing admin guard and rendering a responsive navigation header with links and notifications.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing copyright, tagline, and a link to caffeine.ai with dynamic year and host tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Main site header with live metrics, navigation, logo, donation button, and mobile menu handling.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top-level site layout adding header, footer, routed content, and view-tracking hooks.",
  "frontend/src/components/ledger/LedgerFilters.tsx": "Filter panel for selecting transaction type and sort order in the ledger view.",
  "frontend/src/components/ledger/LedgerTable.tsx": "Tabular display of ledger transactions with type icons, formatted amounts, dates, and status badges.",
  "frontend/src/components/ledger/RecentTransactionsList.tsx": "Card showing the 10 most recent donation and spending records with navigation to transaction details.",
  "frontend/src/components/ledger/SpendingBreakdownCard.tsx": "Pie chart summarizing spending by inferred category with graceful handling of empty data.",
  "frontend/src/config/upi.ts": "Defines UPI payment configuration and generates standardized UPI intent URIs for donations.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and refreshes related queries when it changes.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the current authenticated user is an admin by calling the actor’s isCallerAdmin method.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, and logout through a React context and initializes AuthClient with stored or new identities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching donations, spending, metrics, and donor data using the backend actor.",
  "frontend/src/hooks/useViewTracking.ts": "Handles page‑view registration and live viewer session tracking with retries, heartbeats, and metrics invalidation.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styles.",
  "frontend/src/main.tsx": "Application entry that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminDonationsPage.tsx": "Admin interface for reviewing, confirming, or declining donations, including UTR copying and status filtering.",
  "frontend/src/pages/admin/AdminPortalPage.tsx": "Admin dashboard page showing trust balance, site metrics, and navigation to admin actions using data fetched from hooks.",
  "frontend/src/pages/admin/AdminSpendingPage.tsx": "Spending management page that displays current balance, a form to record spending, and a list of recent spending records.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard UI showing balances, donations, spending, and recent activity with navigation and hero content.",
  "frontend/src/pages/DonatePage.tsx": "Renders the donation page with UPI payment info, transparency details, and a donation form with identity-aware messaging.",
  "frontend/src/pages/DonorDetailPage.tsx": "Displays detailed donor information and their donations, with admin-specific visibility and loading/error states.",
  "frontend/src/pages/DonorsPage.tsx": "Shows a donor list, switching between admin and public profiles based on user status, with loading and empty states.",
  "frontend/src/pages/LedgerPage.tsx": "Combines donations and spending records into a filterable, sortable transaction ledger with loading and empty states.",
  "frontend/src/pages/TransactionDetailPage.tsx": "Displays detailed information for a single donation or spending record, including status, amount, and timestamp.",
  "frontend/src/utils/approvedImage.ts": "Exports the single approved image path used throughout the UI.",
  "frontend/src/utils/donationInputNormalization.ts": "Provides utilities to normalize and validate phone numbers, UTRs, and amount inputs for donation forms.",
  "frontend/src/utils/formatCurrency.ts": "Formats bigint currency values into INR using Indian digit grouping.",
  "frontend/src/utils/maskUtr.ts": "Masks UTR strings for public display by showing only the first and last three characters.",
  "frontend/src/utils/phoneMask.ts": "Masks phone numbers to obscure all but the first five characters.",
  "frontend/src/utils/upiQrImage.ts": "Defines the UPI QR image path, its version, and a helper to generate a cache‑busted URL.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Describes project state, feature requirements, issues, and planned profile‑related updates."
}