{
  "kind": "build_request",
  "title": "Hide donor phone numbers for non-admin users and restrict site to the single uploaded image",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Enforce donor phone-number privacy at the backend API level: when returning donor profiles to non-admin callers, do not expose the full phone number. Only admin callers may receive the full donor phone number; all other callers must receive a masked value (e.g., \"98765******\") or an equivalent representation that does not reveal the hidden digits.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Donor phone numbers MUST be hidden for normal users. Only you, the host/admin, should see the full number. Other users should see something like 98765******."
        ]
      },
      "acceptanceCriteria": [
        "When a non-admin user (including anonymous/public users) calls the donor-profile read APIs, any donor phone number returned is masked and does not contain the original full number.",
        "When an admin user calls the same donor-profile read APIs, the full phone number is returned unchanged (when present).",
        "Masking behavior matches the example format expectation (visible prefix + asterisks), and does not accidentally reveal the hidden digits."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update the frontend donor views to display masked phone numbers for non-admin viewers and full phone numbers only for admins, including the donor detail page where the phone number is currently rendered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Donor phone numbers MUST be hidden for normal users. Only you, the host/admin, should see the full number. Other users should see something like 98765******."
        ]
      },
      "acceptanceCriteria": [
        "On the Donor Detail page, non-admin users see a masked phone number (e.g., \"98765******\") and admins see the full phone number.",
        "No UI path shows an unmasked phone number to non-admin users (including loading/empty states and any table/detail views).",
        "All user-facing text remains in English."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Ensure the site uses ONLY the single user-uploaded donations photo with the “Why Not Us” logo as its image asset across the UI. Remove/replace any references to other generated or placeholder images (for example, the current dashboard hero image at \"/assets/generated/trust-hero.dim_1600x600.png\") so that no other images are used.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Use ONLY the image you uploaded (the donations photo with the Why Not Us logo)."
        ]
      },
      "acceptanceCriteria": [
        "The dashboard hero image no longer loads \"/assets/generated/trust-hero.dim_1600x600.png\" (or any other non-approved image), and instead uses the single uploaded donations photo asset.",
        "No other pages/components reference additional generated images; the application visually uses only the uploaded donations photo asset wherever an image is rendered.",
        "No new images are generated or added as part of this change."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; implement the change in backend/main.mo and add backend/migration.mo only if persistent state schema changes are required.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose instead).",
    "Do not generate or introduce any new image assets; use only the existing user-uploaded donations photo with the “Why Not Us” logo."
  ],
  "nonGoals": [
    "Do not add new authentication methods beyond Internet Identity.",
    "Do not implement WhatsApp/email donor notifications.",
    "Do not redesign pages beyond what is required to (1) enforce phone masking privacy and (2) remove usage of non-approved images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}